Repository: seanpm2001/mt-training-data
Catalog: st/st_pontoon.tmx
Source language: en_us
Languages: st

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
st: Re batla hore pokello ya data ya Common Voice e bonahatse boleng ba audio boo enjene ya puo-ho-ya-ho-sengolwa e tla e utlwa hara thota, kahoo re batla mefuta e fapaneng. Ka tlatselletsa ho mefuta-futa ya ditjhaba tsa dibui, pokello ya data e nang le di-audio tse boleng bo fapaneng e tla ruta enjene ya puo-ho-ya-ho-sengolwa ho sebetsana le maemo a lefatshe a fapaneng, ho tloha ho dipuisano tse kamorao ho isa ho lerata la koloi. Ha feela sekotwana sa lentswe sa hao se utlwahala, se tla be se lokile ho lekana bakeng sa pokello ya data.

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
st: Re batla hore di-algorithm tsa ho ithuta motjhini di kgone ho sebetsana le mefuta e fapaneng ya lerata le kamorao, mme le marata a hodimo a ka amohelwa ha feela a sa o setisi hore o utlwe sengolwa se felletseng. Lerata la mmino le kamorao le thotseng le nepahetse; mmino o phahameng haholo o sitisang hore o utlwe lentswe le leng le le leng wona ha wa nepahala.

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
st: Hape re tla <strong>tsebisa mookamedi wa setjhaba sa rona hore o na le thahasello</strong>, kahoo ba ka o fa tshehetso e feng kapa feng e eketsehileng kapa dintlha tseo o ka di hlokang.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
st: Re tla ikopanya ka dintlha tse ding mabapi le mokgwa wa ho kenya puo ya hao ho Common Voice haufinyane.

source: We will be in touch with more information as it becomes available.
st: Re tla ikopanya le wena ka dintlha tse ding ha di ntse di fumaneha.

source: We will not make your email public.
st: Re ke ke ra etsa hore imeile ya hao e phatlalatswe.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
st: Re tla hlahloba kopo ya hao ya ho tlosa direkoto tsa lentswe la hao ho pokello ya data. Haeba kopo ya hao e amohelehile, re tla ikopanya le ba neng ba se ba download-ile pokello ya data mme re kope hore ba tlose direkoto tsa lentswe la hao le bona.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
st: Ho bolelang hore ha ke kgone "ho tseba hore na ke bo-mang" ba dibui ho pokello ya data ya Common Voice?

source: What is a language on Common Voice?
st: Puo ho Common Voice ke eng?

source: What is Common Voice?
st: Common Voice ke Eng?

source: What issues are you experiencing with this sentence?
st: O na le mathata afe ka polelo ee?

source: What kind of goal do you want to build?
st: O batla ho iketsetsa sepheo sa mofuta ofe?

source: What level of audio quality is required for a voice clip to be used in the dataset?
st: Ke boemo bofe ba boleng ba audio bo hlokahalang hore clip ya lentswe e sebediswe ho pokello ya data?

source: What’s inside the Common Voice dataset?
st: Ho na le eng ka hara pokello ya data ya Common Voice?

source: What's Public?
st: Phatlalatsa ke Eng?

source: What’s the difference between Common Voice and Deep Speech?
st: Phapano ke efe dipakeng tsa Common Voice le Deep Speech?

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
st: Ha mosebedisi a hana sekotwana sa lentswe e kgutlela Lethathamong. Haeba e hanwa lekgetlo la bobedi, sekotwana sa lentswe e iswa ho Lebitla la dikotwana.

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
st: Ha o mametse, sheba ka hloko hore se rekotilweng ke sona hantle se ngotsweng; hana haeba ho na le diphoso le tse nyane. <br /> Diphoso tse tlwaelehileng haholo di kenyelletsa:

source: When will you release Common Voice data in other languages?
st: O tla lokolla data ya Common Voice neng ka dipuo tse ding?

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
st: Ha o kopa direkoto tsa hao, re di kopanya hore e be faele e le nngwe kapa tse ngata tsa ZIP. Dikopo tsa hao tsa nakong e fetileng ke tsena:

source: Where are these <wikipediaLink>public domain</wikipediaLink> sentences from?
st: Dipolelo tsee<wikipediaLink>tsa setjhaba</wikipediaLink> di tswa hokae?

source: Where does the source text come from?
st: mongolo mohlodi o tswa hokae?

source: Which variant of { $language } do you speak?
st: O bua mofuta ofe wa { $language }?

source: Why ?
st: Hobaneng ?

source: Why a profile?
st: Hobaneng profaele?

source: Why Common Voice?
st: Hobaneng Common Voice?

source: Why does this matter?
st: Ke hobane’ng ha see se le bohlokwa?

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
st: Hobaneng o sa kope batho ho bala ho tswa dibukeng kapa dingodilweng tsa Wikipedia ka dipuo tse fapaneng?

source: Why do you need so many different speakers per language?
st: Ke hobaneng ha o hloka dibui tse ngata tse fapaneng puo ka nngwe?

source: Why is 10,000 validated hours the per language goal for capturing audio?
st: Hobaneng dihora tse 10,000 tse netefaditsweng e le sepheo sa puo ka nngwe ya ho nka modumo?

source: Why is Common Voice part of the Mozilla mission?
st: Hobaneng ha Common Voice e le karolo ya thomo ya Mozilla?

source: Why is it important?
st: Ke hobaneng ha e le ya bohlokwa?

source: Why is my language not included yet?
st: Ke hobaneng ha puo ya ka e so kenyeletswe?

source: Why should I sign up for an account?
st: Hobaneng ke lokela ho ingodisa bakeng sa ak'haonte?

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
st: Na o ka rata ho kopa direkoto tsa mantswe tsa hao di hlakolwe, kapa o kgetha ho di boloka kahara pokello ya data ya Common Voice?

source: y
st: Ee

source: Y
st: Ee

source: Yes
st: Ee

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
st: Ee, nthomelle di-imeile. Nka rata ho dula ke tseba ka morero wa Common Voice.

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
st: Ee, nthomelle di-email. Nka thabela ho dula ke tseba ka tswelopele ya puo ena ho Common Voice.

source: Yes, we especially want your voice! Part of the aim of Common Voice is to gather as many different accents as possible so that voice recognition services work equally well for everyone. This means donations from non-native speakers are particularly important.
st: E, re batla haholoholo lentswe la hao! Karolo e nngwe ya sepheo sa Common Voice ke ho bokella ditsela tsa puo tse ngata tse fapaneng hore ditshebeletso tsa temoho ya mantswe di sebetse hantle ka mokgwa o tshwanang ho bohle. Hona ho bolela hore menehelo e tswang ho batho bao e seng matswallwa are bohlokwa ho feta.

source: You
st: Wena

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
st: O mothating wa ho qala ho download-a <size>{ $size }GB</size>,e tswelepele?

source: You are prepared to initiate a download of <b>{ $size }</b>
st: O se o ikemiseditse ho download-a <b>{ $size }</b>

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
st: O ka boela wa kopitsa le ho manamisa URL ka ho thatohatsi ya hao ya mookamedi wa download. Di tla fela ka mora dihora tse 12, empa o ka kgutlela ho leqhephe lena ho hlahisa tse ntjha neng kapa neng.

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
st: O ka boela wa sebedisa Dikgaoletso tsa Keyboard: { sc-review-form-button-approve-shortcut } ho Amohela, { sc-review-form-button-reject-shortcut } ho Hana, { sc-review-form-button-skip-shortcut } ho Tlola

source: You can choose to make your username public or anonymous.
st: O ka kgetha ho etsa hore lebitso la hao la mosebedisi le phatlalatswe kapa le se ke la tsejwa.

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
st: O ka ya ho <datasetsPage>leqephe la dipokello tsa data</datasetsPage>, kgetha mofuta le (di)puo tseo o di batlang, mme o e download-e! Difaele di na le <metadataLink>metadata e amanang le tsona</metadataLink>, jwaloka dintlha tsa batho palo le data ya ho netefatsa. O tla hloka ho fana ka aterese ya imeile ho download-a pokello ya data.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
st: O ka thusa ho aha pokello ya data e fapaneng, ya mohlodio bulehileng ka ho theha profaele ya hao ya Common Voice le ho kenya lentswe la hao.

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
st: O ka kopana le ba bang ba ditjhaba tsa dipuo tsa Mozilla ka ho kenela <discourseLink>Discourse</discourseLink> bakeng sa dipuisano tsa sehlooho, kapa <matrixLink>Matrix</matrixLink> bakeng sa keletso e potlakileng.

source: You cannot request your recordings while another request is already in progress.
st: O ke ke wa kopa direkoto tsa hao ha kopo e nngwe e ntse e tswelapele.

source: You can request a new takeout of your recordings every { $days } days.
st: O ka kopa ho direkoto tsa hao ka mora a mang le a mang { $days } matsatsi.

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
st: O ka tsamaisa diketsahalo ho thusa batho hore ba tlatsetse. Ho bonolo ho feta kamoo o nahanang. O ka e etsa ka marang-rang ka sesebediswa sa seboka-sa-video, kapa ka seqo haeba ho bolokehile ho etsa jwalo. <eventTemplate>Sheba mehlala le disebediswa tsa rona tsa ho tsamaisa diketsahalo</eventTemplate>.

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
st: O ka <sentenceCollectorLinkAdd>kenya dipalo tse nyane tsa dipolelo</sentenceCollectorLinkAdd>, kapa o ka etsa <bulkImportDocsLink>wa kenya tsa kantle ka bongata o sebedisa Github</bulkImportDocsLink>. Hopola hore dipolelo di hloka ho <licenseLink>CC0 (kapa phatlalatsa)</licenseLink>, kapa o ka ingolla tsa hao.

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
st: O ka sebedisa <scraperLink>Sesebediswa se hulang dipolelo</scraperLink> ho sebedisa dipolelo tse kgutshwanyane ho tloha Wikipedia.

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
st: O ka kenyelletsa sebaka sa Marang-rang, mohlala, "Common Voice - https://commonvoice.mozilla.org/"

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
st: O ka sebedisa mokgwa wa ditshupiso tsa thuto, mohlala, mokgwa wa Harvard "Mozilla (2021) Common Voice. E fumaneha ho https://commonvoice.mozilla.org/ (E fumanehile: ka la 15 Loetse 2021)"

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
st: O ka sebedisa marang-rang a setjhaba ho fetisa molaetsa. Arolelana diposo tse hlalosang hore na ke hobaneng ho le bohlokwa, mme ikopanye le batho ba bang ba buang ka ditaba tse kang ditokelo tsa puo, AI ya lentswe, kapa leeme kahara thekenoloji. Sheba dikeletso tse ding mabapi le<campaignLink> ho tsamaisa letsholo la setjhaba, ho kenyelletsa le ditaba tseo o ka di sebedisang hape</campaignLink>.

source: You have not added any languages yet.
st: Ha o so kenye dipuo tse ding hohang.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
st: Ha wa kgetha dipuo di feng kapa di feng. Ka kopo e ya ho <profileLink>Profaele</profileLink> ho kgetha dipuo.

source: You must allow microphone access.
st: O tlameha ho dumella tshebediso ya maekrofounu.

source: You previously skipped sentences while reviewing. Resetting skipped sentences will show all skipped sentences again. This is independent of the language.
st: O ile wa tlola dipolelo ha o ntse o hlahloba. Ho hlophisa botjha dipolelo tse tlotsweng ho tla bontsha dipolelo tsohle tse tlotsweng hape. Sena se ikemetse ho puo.

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
st: Puo ya hao ke tsela eo o bitsang mantswe ka eona. E ka boptjwa ke moo o kileng wa phela teng, dipuo tse ding tseo o di buang le dintlha tse ding tse ngata. O ka arolelana ka dintlha di feng kapa di feng tseo o utlwang eka di ka ba bohlokwa mona.

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
st: Direkoto tsa hao tsa lentswe tse sa tsejweng di tla sala ho pokello ya data ya Common Voice. Hang ha o hlakola profaele ya hao o ke ke wa hlola o kgona ho fana ka kopo ya ho tlosa direkoto tsa hao ho pokello ya data.

source: Your daily goal has been created
st: Sepheo sa hao sa letsatsi le letsatsi se entswe

source: Your download has started.
st: Download ya hao e qadile.

source: You’re contributing to a target segment
st: O kenya letsoho karolong e lebeletsweng

source: You’re contributing to our first target segment
st: O kenya letsoho karolong ya sepheo sa rona sa pele

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
st: Hajwale o se o ikemiseditse ho <bold>ESENG</bold> ho fumana di-imeile jwalo ka dikgopotso tsa sepheo, dintlha tse ntjha ka tswelopele yaka le dikoranta mabapi le Common Voice

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
st: Hajwale o se o ikemiseditse ho amohela di-email jwaloka dikgopotso tsa sepheo, dintlha tse ntjha ka tswelopele yaka le dikoranta mabapi le Common Voice

source: Your email address
st: Aterese ya hao ya imeile

source: Your files are being assembled. Please check again later.
st: Difaele tsa hao di ntse di kopanngwa. Ka kopo sheba hape hamorao.

source: Your languages:
st: Dipuo tsa hao:

source: Your Languages
st: Dipuo tsa Hao

source: Your username and email will not be associated with the published data.
st: Lebitso la hao la mosebedisi le imeile di ke ke tsa amahanngwa le data e phatlaladitsweng.

source: Your weekly goal has been created
st: Sepheo sa hao sa beke se entswe

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
st: O lokela ho fumana imeile haufinyane e hlalosang mehato ya ho kenya puo ya hao ho Common Voice

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
st: O thusitse Common Voice ho fihlela <goalPercentage></goalPercentage> sepheo sa rona sa letsatsi le letsatsi { $goalValue } sa ho rekota!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
st: O thusitse Common Voice ho fihlela <goalPercentage></goalPercentage> ya sepheo sa rona sa letsatsi le letsatsi sa { $goalValue } netefatso!

source: You've successfully signed up for contributing to { $language }. Thank you.
st: O atlehile ho ingodisa ho tlatsetsa ho { $language }. Rea leboha.

source: Zip #{ $offset } of { $total }
st: Zip #{ $offset } ya { $kakaretso }
